Информационная_база/src/Documents/ПлатежнаяВедомость/ПлатежнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежнаяВедомость</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПлатежнаяВедомость</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/AccumulationRegisters/РасчетыСПерсоналом/РасчетыСПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПерсоналом</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/Enums/ВидыОперацийПлатежнаяВедомость/ВидыОперацийПлатежнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПлатежнаяВедомость</name>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Documents/ПлатежнаяВедомость/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Сотрудники.Итог("СуммаПлатежа");
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура заполняет табличную часть Сотрудники остатками по начислениям.
//
Процедура ЗаполнитьПоОстаткамНаСервере() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Зарплата Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСПерсоналомОстатки.Сотрудник КАК Сотрудник,
		|	СУММА(ВЫБОР
		|			КОГДА &ВалютаРасчетов = &ВалютаДокумента
		|				ТОГДА РасчетыСПерсоналомОстатки.СуммаВалОстаток
		|			ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПерсоналомОстатки.СуммаВалОстаток * &Курс / &Кратность КАК ЧИСЛО(15, 2))
		|		КОНЕЦ) КАК СуммаПлатежа,
		|	СУММА(РасчетыСПерсоналомОстатки.СуммаВалОстаток) КАК СуммаРасчетов
		|ИЗ
		|	РегистрНакопления.РасчетыСПерсоналом.Остатки(
		|			,
		|			Организация = &Организация
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И Валюта = &ВалютаРасчетов
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК РасчетыСПерсоналомОстатки
		|ГДЕ
		|	РасчетыСПерсоналомОстатки.СуммаВалОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСПерсоналомОстатки.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасчетыСПерсоналомОстатки.Сотрудник.Наименование";
		
		Запрос.УстановитьПараметр("ПериодРегистрации", 	ПериодРегистрации);
		Запрос.УстановитьПараметр("Организация", 		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("ВалютаРасчетов",		ВалютаРасчетов);
		Запрос.УстановитьПараметр("ВалютаДокумента",	ВалютаДокумента);
		Запрос.УстановитьПараметр("Курс",				Курс);
		Запрос.УстановитьПараметр("Кратность",			Кратность);
		
		Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежнаяВедомость.Аванс Тогда	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'При выплате аванса заполнение по остаткам не предусмотрено!'");
 		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет табличную часть Сотрудники по подразделению.
//
Процедура ЗаполнитьПоПодразделениюНаСервере() Экспорт
	
	// Сотрудники:
	// 1. Уволенные, переведенные из 
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 2. Работающие.
	//  - на начало периода есть запись о принадлежности к указанному подразделению;
	// 3. Принятые на работу, переведенные в
	//  - в течении периода будет запись с указанным подразделением;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"
	// Пункты 1 и 2
	|Выбрать РАЗРЕШЕННЫЕ
	|	Максимум(СотрудникиСрезПоследних.Период) КАК Период
	|	,СотрудникиСрезПоследних.Сотрудник КАК Сотрудник
	|Поместить СотрудникиЧислящиесяНаНачалоПериода
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&ПериодРегистрации, Организация = &Организация) КАК СотрудникиСрезПоследних
	|Где СотрудникиСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|Сгруппировать по СотрудникиСрезПоследних.Сотрудник, СотрудникиСрезПоследних.СтруктурнаяЕдиница
	|
	// Пункт 3
	|;Выбрать РАЗРЕШЕННЫЕ
	|	Сотрудники.Период КАК Период
	|	,Сотрудники.Сотрудник КАК Сотрудник
	|Поместить СотрудникиПереведенныеПринятыеВПериоде
	|Из РегистрСведений.Сотрудники КАК Сотрудники
	|Где Сотрудники.Организация = &Организация
	|	И Сотрудники.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сотрудники.Период МЕЖДУ &ПериодРегистрации И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|
	// Результирующая выборка
	|;Выбрать РАЗРЕШЕННЫЕ
	|	СотрудникиЧислящиесяНаНачалоПериода.Сотрудник
	|Из СотрудникиЧислящиесяНаНачалоПериода КАК СотрудникиЧислящиесяНаНачалоПериода
	|
	|Объединить
	|
	|Выбрать 
	|	СотрудникиПереведенныеПринятыеВПериоде.Сотрудник
	|Из СотрудникиПереведенныеПринятыеВПериоде КАК СотрудникиПереведенныеПринятыеВПериоде";

	Запрос.УстановитьПараметр("ПериодРегистрации",	ПериодРегистрации);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация",		УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
